# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [4]:
#Your code here
cur.execute('''select firstName, lastName from employees e 
                            join offices o
                            on e.officeCode = o.officeCode
                            where o.city = 'Boston';
                            ''')
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?

In [21]:
#Your code here
cur.execute('''select city, state,
                    count(*)
                    from offices
                    left join employees
                    using(officeCode)
                    group by 1;''')

df = pd.DataFrame(cur.fetchall())
df.head()

               0   1  2
0         Boston  MA  2
1         London      2
2            NYC  NY  2
3          Paris      5
4  San Francisco  CA  6

## Write 3 Questions of your own and answer them

In [23]:
# How many product sold from a particular vendor?

cur.execute('''select productVendor,
                    count(*)
                    from products
                    left join orderDetails
                    using(productCode)
                    group by 1;''')

df = pd.DataFrame(cur.fetchall())
df.head()

                          0    1
0     Autoart Studio Design  221
1  Carousel DieCast Legends  246
2   Classic Metal Creations  270
3             Exoto Designs  240
4      Gearbox Collectibles  242

In [31]:
# How many products were sold from particular product lines

cur.execute('''select productLine,
                    count(*)
                    from products
                    join orderDetails
                    using(productCode)
                    group by 1;''')

df = pd.DataFrame(cur.fetchall())
df.head()

              0     1
0  Classic Cars  1010
1   Motorcycles   359
2        Planes   336
3         Ships   245
4        Trains    81

In [32]:
# How many customers did each employee 

cur.execute('''select firstName, lastName,
                    count(*)
                    from employees e
                    left join customers j
                    on e.employeeNumber = j.salesRepEmployeeNumber
                    group by 1;''')

df = pd.DataFrame(cur.fetchall())
df.head()

          0       1  2
0      Andy  Fixter  5
1   Anthony     Bow  1
2     Barry   Jones  9
3     Diane  Murphy  1
4  Foon Yue   Tseng  7

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!